In [1]:
import pandas as pd

In [5]:
data = "data/kanto_populations.csv"
df = pd.read_csv(data,sep=",",skiprows=5)

In [25]:
print(df.shape)
print(df.info())
display(df)

(7, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pref    7 non-null      object
 1   pop     7 non-null      int64
 2   birth   7 non-null      int64
 3   death   7 non-null      int64
dtypes: int64(3), object(1)
memory usage: 352.0+ bytes
None

       pref       pop  birth   death
0   Ibaraki   2852000  17389   32931
1   Tochigi   1921000  11808   21702
2     Gunma   1927000  11660   23286
3   Saitama   7340000  47328   70758
4     Chiba   6275000  40168   62118
5     Tokyo  14010000  99661  121219
6  Kanagawa   9236000  60865   84601

In [7]:
df['birth'].dtype

dtype('int64')

In [8]:
df['pref']

0     Ibaraki
1     Tochigi
2       Gunma
3     Saitama
4       Chiba
5       Tokyo
6    Kanagawa
Name: pref, dtype: object

In [9]:
df[['pref', 'pop']]

       pref       pop
0   Ibaraki   2852000
1   Tochigi   1921000
2     Gunma   1927000
3   Saitama   7340000
4     Chiba   6275000
5     Tokyo  14010000
6  Kanagawa   9236000

In [24]:
df.loc[3:6,"death"]

3     70758
4     62118
5    121219
6     84601
Name: death, dtype: int64

In [26]:
df.at[0,"birth"]

17389

In [27]:
df.at[1,"pop"]

1921000